
# ###############################################################
# # ცვლადების შექმნა
# ###############################################################

var_1 = 5
var_2 = 5.3
var_3 = "cvladi"
var_4 = True
print(var_1)
print(var_2)
print(var_3)
print(var_4)
print(type(var_1))
print(type(var_2))
print(type(var_3))
print(type(var_4))



###############################################################
# ასაკის გაგება
###############################################################

date = int((input("თქვენი დაბადების თარიღი: ")))
print("ჩემი დაბადების თარიღი არის:", date)

num1 = 2025
num2 = num1 - date

print("ასაკი: ", num2 , "წლის")


###############################################################
# დადგენა არის თუ არა მოწოდებული რიცხვი დადებითი,უარყოფითი ან ნული
###############################################################




num1 = int(input("შეიყვანეთ ნებისმიერი რიცხვი: "))

num3 = num1 > 0
print("დადებითი: ", bool(num3))


num3 = num1 < 0
print("უარყოფითი: ", bool(num3))

num3 = num1 == 0
print("ნული: ", bool(num3))

num3 = num1 % 2 == 0
print("ლუწი: ", bool(num3))

num3 = num1 % 2 == 1
print("კენტი: ", bool(num3))










