

############################################################
# ინიციალების ამომღები
############################################################


first_name = input("შეიყვანეთ თქვენი სახელი: ")
second_name = input("შეიყვანეთ თქვენი გვარი: ")


first_initial = first_name[0]
second_initial = second_name[0]

first_initial = first_initial.upper()
second_initial = second_initial.upper()

print(f"თქვენი ინიციალები არის: {first_initial}.{second_initial}")



############################################################
# სიტყვის შემობრუნება
############################################################

word = input("შეიყვანეთ ნებისმიერი სიტყვა: ")

word = word[::-1]

print(word)




############################################################
# სიტყვის შემობრუნება
############################################################



sentence = input("შეიყვანეთ თქვენთვის სასურველი წინადადება: ")
word_1 = input("რომელი სიტყვა უნდა შეიცვალოს წინადადებაში: ")
word_2 = input("რით უნდა შეიცვალოს მოცემული სიტყვა: ")

sentence = sentence.replace(word_1, word_2)



print(sentence)





















































